TI-FIRST/MSP430-Gamepad/driverlib/MSP430F5xx_6xx/usci_uart.c
        return HWREG8(baseAddress + OFS_UCAxSTAT) & mask;
}

//*****************************************************************************
//
//! \brief Sets the UART module in dormant mode
//!
//! Puts USCI in sleep mode. Only characters that are preceded by an idle-line
//! or with address bit set UCRXIFG. In UART mode with automatic baud-rate
//! detection, only the combination of a break and sync field sets UCRXIFG.
//!
//! \param baseAddress is the base address of the USCI_UART module.
//!
//! Modified bits of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_UART_setDormant(uint32_t baseAddress)
{
        HWREG8(baseAddress + OFS_UCAxCTL1) |= UCDORM;
}

//*****************************************************************************
//
//! \brief Re-enables UART module from dormant mode
//!
//! Not dormant. All received characters set UCRXIFG.
//!
//! \param baseAddress is the base address of the USCI_UART module.
//!
//! Modified bits are \b UCDORM of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_UART_resetDormant(uint32_t baseAddress)
{
        HWREG8(baseAddress + OFS_UCAxCTL1) &= ~UCDORM;
}

//*****************************************************************************
//
//! \brief Transmits the next byte to be transmitted marked as address
//! depending on selected multiprocessor mode
//!
//! \param baseAddress is the base address of the USCI_UART module.
//! \param transmitAddress is the next byte to be transmitted
//!
//! Modified bits of \b UCAxTXBUF register and bits of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_UART_transmitAddress(uint32_t baseAddress,
                               uint8_t transmitAddress)
{
        //Set UCTXADDR bit
        HWREG8(baseAddress + OFS_UCAxCTL1) |= UCTXADDR;

        //Place next byte to be sent into the transmit buffer
        HWREG8(baseAddress + OFS_UCAxTXBUF) = transmitAddress;
}

//*****************************************************************************
//
//! \brief Transmit break.
//!
//! Transmits a break with the next write to the transmit buffer. In UART mode
//! with automatic baud-rate detection, USCI_UART_AUTOMATICBAUDRATE_SYNC(0x55)
//! must be written into UCAxTXBUF to generate the required break/sync fields.
//! Otherwise, DEFAULT_SYNC(0x00) must be written into the transmit buffer.
//! Also ensures module is ready for transmitting the next data.
//!
//! \param baseAddress is the base address of the USCI_UART module.
//!
//! Modified bits of \b UCAxTXBUF register and bits of \b UCAxCTL1 register.
//!
//! \return None
//
//*****************************************************************************
void USCI_UART_transmitBreak(uint32_t baseAddress)
{
        //Set UCTXADDR bit
        HWREG8(baseAddress + OFS_UCAxCTL1) |= UCTXBRK;

        //If current mode is automatic baud-rate detection
        if (USCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE ==
            (HWREG8(baseAddress + OFS_UCAxCTL0) &
             USCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE))
                HWREG8(baseAddress + OFS_UCAxTXBUF) = USCI_UART_AUTOMATICBAUDRATE_SYNC;
        else
                HWREG8(baseAddress + OFS_UCAxTXBUF) = DEFAULT_SYNC;

        //If interrupts are not used, poll for flags
        if (!(HWREG8(baseAddress + OFS_UCAxIE) & UCTXIE))
                //Poll for transmit interrupt flag
                while (!(HWREG8(baseAddress + OFS_UCAxIFG) & UCTXIFG)) ;
}

//*****************************************************************************
//
//! \brief Returns the address of the RX Buffer of the UART for the DMA module.
//!
//! Returns the address of the UART RX Buffer. This can be used in conjunction
//! with the DMA to store the received data directly to memory.
//!
//! \param baseAddress is the base address of the USCI_UART module.
//!
//! \return Address of RX Buffer
//
//*****************************************************************************
uint32_t USCI_UART_getReceiveBufferAddressForDMA(uint32_t baseAddress)
{
        return baseAddress + OFS_UCAxRXBUF;
}

//*****************************************************************************
//
//! \brief Returns the address of the TX Buffer of the UART for the DMA module.
//!
//! Returns the address of the UART TX Buffer. This can be used in conjunction
//! with the DMA to obtain transmitted data directly from memory.
//!
//! \param baseAddress is the base address of the USCI_UART module.
//!
//! \return Address of TX Buffer
//
//*****************************************************************************
uint32_t USCI_UART_getTransmitBufferAddressForDMA(uint32_t baseAddress)
{
        return baseAddress + OFS_UCAxTXBUF;
}

#endif
//*****************************************************************************
//
//! Close the doxygen group for usci_uart_api
//! @}
//
//*****************************************************************************
//Released_Version_4_10_02
